In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('agora.csv')
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [3]:
df.isnull().sum()

Marketing Spend    0
Administration     0
Transport          1
Area               0
Profit             0
dtype: int64

# Handle Nan

In [4]:
df.Transport.mean()

215331.73244897963

In [8]:
df.Transport.sum() / 49

215331.7324489796

In [6]:
df.Transport.shape

(50,)

In [9]:
mean = df.Transport.mean()

In [11]:
#df.isnull()

In [14]:
df.Transport = df.Transport.fillna(mean)
df.isnull().sum()

Marketing Spend    0
Administration     0
Transport          0
Area               0
Profit             0
dtype: int64

In [17]:
# df.isnull() # check missing value in each index

In [18]:
median = df.Transport.median()

In [19]:
median

214983.2712244898

# Without Encoding

In [24]:
df.Area.unique()

array(['Dhaka', 'Ctg', 'Rangpur'], dtype=object)

In [25]:
df.Area = df.Area.replace(['Dhaka', 'Ctg', 'Rangpur'],[3,2,1]) #just replace the value

In [26]:
df.head()

   Marketing Spend  Administration  Transport  Area     Profit
0        114523.61       136897.80  471784.10     3  192261.83
1        162597.70       151377.59  443898.53     2  191792.06
2        153441.51       101145.55  407934.54     1  191050.39
3        144372.41       118671.85  383199.62     3  182901.99
4        142107.34        91391.77  366168.42     1  166187.94

# Label Encoder

In [30]:
df = pd.read_csv('agora.csv')
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [31]:
from sklearn.preprocessing import LabelEncoder

In [32]:
le = LabelEncoder()

In [33]:
df.Area = le.fit_transform(df.Area)

In [34]:
df.head()

   Marketing Spend  Administration  Transport  Area     Profit
0        114523.61       136897.80  471784.10     1  192261.83
1        162597.70       151377.59  443898.53     0  191792.06
2        153441.51       101145.55  407934.54     2  191050.39
3        144372.41       118671.85  383199.62     1  182901.99
4        142107.34        91391.77  366168.42     2  166187.94

# LE with LOOP

In [39]:
df = pd.read_csv('agora.csv')
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [42]:
for column in df.columns:
    if df[column].dtype == np.number:
        continue
    df[column] = le.fit_transform(df[column])

<ipython-input-42-a645681004ae>:2: DeprecationWarning: Converting `np.inexact` or `np.floating` to a dtype is deprecated. The current result is `float64` which is not strictly correct.
  if df[column].dtype == np.number:

In [43]:
df.head()

   Marketing Spend  Administration  Transport  Area     Profit
0        114523.61       136897.80  471784.10     1  192261.83
1        162597.70       151377.59  443898.53     0  191792.06
2        153441.51       101145.55  407934.54     2  191050.39
3        144372.41       118671.85  383199.62     1  182901.99
4        142107.34        91391.77  366168.42     2  166187.94

# One Hot Encoder

In [44]:
df = pd.read_csv('agora.csv')
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [48]:
dummy = pd.get_dummies(df['Area'],drop_first=True)

In [50]:
dummy.head()

   Dhaka  Rangpur
0      1        0
1      0        0
2      0        1
3      1        0
4      0        1

In [52]:
df = df.drop('Area',axis=1)

In [53]:
df.head()

   Marketing Spend  Administration  Transport     Profit
0        114523.61       136897.80  471784.10  192261.83
1        162597.70       151377.59  443898.53  191792.06
2        153441.51       101145.55  407934.54  191050.39
3        144372.41       118671.85  383199.62  182901.99
4        142107.34        91391.77  366168.42  166187.94

In [55]:
df2 = pd.concat([df,dummy],axis=1)

In [57]:
df2.head()

   Marketing Spend  Administration  Transport     Profit  Dhaka  Rangpur
0        114523.61       136897.80  471784.10  192261.83      1        0
1        162597.70       151377.59  443898.53  191792.06      0        0
2        153441.51       101145.55  407934.54  191050.39      0        1
3        144372.41       118671.85  383199.62  182901.99      1        0
4        142107.34        91391.77  366168.42  166187.94      0        1

In [61]:
x = df2.drop('Profit',axis=1)

In [62]:
y = df.Profit

In [63]:
x.head()

   Marketing Spend  Administration  Transport  Dhaka  Rangpur
0        114523.61       136897.80  471784.10      1        0
1        162597.70       151377.59  443898.53      0        0
2        153441.51       101145.55  407934.54      0        1
3        144372.41       118671.85  383199.62      1        0
4        142107.34        91391.77  366168.42      0        1

In [64]:
y.head()

0    192261.83
1    191792.06
2    191050.39
3    182901.99
4    166187.94
Name: Profit, dtype: float64

# Ordinal  Encoding

In [65]:
df = pd.read_csv('agora.csv')
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [66]:
df.Area.unique()

array(['Dhaka', 'Ctg', 'Rangpur'], dtype=object)

In [67]:
cities = ['Dhaka', 'Ctg', 'Rangpur']

In [69]:
from sklearn.preprocessing import OrdinalEncoder

In [72]:
ordinal = OrdinalEncoder(categories=[cities])

In [75]:
enc = ordinal.fit_transform(df[['Area']])

In [79]:
new_cities = pd.DataFrame(enc,columns=['Area'])

In [81]:
new_cities.head()

   Area
0   0.0
1   1.0
2   2.0
3   0.0
4   2.0

# Hasing Encoder

In [82]:
df = pd.read_csv('agora.csv')
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [84]:
!pip install category_encoder

ERROR: Could not find a version that satisfies the requirement category_encoder
ERROR: No matching distribution found for category_encoder

In [86]:
import category_encoders as ce

In [92]:
category = ce.HashingEncoder(cols='Area', n_components=3) # shift+tab button

In [93]:
encoder2 = category.fit_transform(df['Area'])

In [94]:
encoder2

    col_0  col_1  col_2
0       0      1      0
1       0      0      1
2       1      0      0
3       0      1      0
4       1      0      0
5       0      1      0
6       0      0      1
7       1      0      0
8       0      1      0
9       0      0      1
10      1      0      0
11      0      0      1
12      1      0      0
13      0      0      1
14      1      0      0
15      0      1      0
16      0      0      1
17      0      1      0
18      1      0      0
19      0      1      0
20      0      0      1
21      0      1      0
22      1      0      0
23      1      0      0
24      0      1      0
25      0      0      1
26      1      0      0
27      0      1      0
28      1      0      0
29      0      1      0
30      1      0      0
31      0      1      0
32      0      0      1
33      1      0      0
34      0      0      1
35      0      1      0
36      1      0      0
37      0      0      1
38      0      1      0
39      0      0      1
40      0      0      1
41      1      0      0
42      0      0      1
43      0      1      0
44      0      0      1
45      0      1      0
46      1      0      0
47      0      0      1
48      0      1      0
49      0      0      1